85hzc/ask_433/stm32f1_cube/Src/main.c
        ptr = UsartType2.RX_pData;

        memset(key, 0, sizeof(key));

        strncpy(key,ptr,UsartType2.RX_Size);
        AppControlHandle(key);
        HAL_UART_Transmit(&DEBUG_UART, UsartType2.RX_pData, UsartType2.RX_Size, 0xffff);
    }
    //debug
    if(UsartType3.RX_flag)
    {
        UsartType3.RX_flag = 0;

        ptr = UsartType3.RX_pData;

        memset(key, 0, sizeof(key));
        strncpy(key,ptr,UsartType3.RX_Size);
        UartControlHandle(key);
        HAL_UART_Transmit(&DEBUG_UART, UsartType3.RX_pData, UsartType3.RX_Size, 0xffff);
    }
#if 0
    /* 1. read the uart buffer... */
    if (HAL_OK == Drv_SERIAL_Read(single_cmd, 0))
    {
        if (Drv_CMD_Handler(single_cmd) > 0)
        {
            if (CMD_HEADER_REQ == single_cmd[0])
            {
                single_cmd[0] = CMD_HEADER_RSP;
                Drv_SERIAL_Write(single_cmd, 0);
            }
        }
    }
#endif
    /* 2. read the action buffer... */
    if (HAL_OK == Drv_SERIAL_Read_Act(single_cmd))
    {
        //printf("Act location:0x%x 0x%x 0x%x 0x%x\r\n",
        //        single_cmd[0],single_cmd[1],single_cmd[2],single_cmd[3]);
        (void)Drv_CMD_Handler(single_cmd);
    }
}

int main(void)
{

    /* USER CODE BEGIN 1 */

    /* USER CODE END 1 */

    /* MCU Configuration----------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* Configure the system clock */
    SystemClock_Config();  //systick 1ms

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_USART1_UART_Init();
    MX_USART2_UART_Init();
    MX_USART3_UART_Init();
    //MX_TIM2_Init();//for PWM pulse

#if(IR_REMOTE)
    MX_TIM3_Init();//for IR INT
    /* Initialize IR state */
    Drv_IR_Init();
#endif

#ifdef SUPPORT_FATFS
#ifdef SPI_HARD
    SPI_Configuration();    //SPI初始化
#else
    SPI_GPIO_Soft_Init();
#endif
#endif
    appInit();

    printf("system start.\r\n");
    //Drv_PWM_Init();

#if 1
    HAL_UART_Receive_DMA(&huart1, UsartType1.RX_pData, UART_RX_LEN);
    __HAL_UART_ENABLE_IT(&huart1, UART_IT_IDLE);

    HAL_UART_Receive_DMA(&huart2, UsartType2.RX_pData, UART_RX_LEN);
    __HAL_UART_ENABLE_IT(&huart2, UART_IT_IDLE);

    HAL_UART_Receive_DMA(&huart3, UsartType3.RX_pData, UART_RX_LEN);
    __HAL_UART_ENABLE_IT(&huart3, UART_IT_IDLE);
#else
    HAL_UART_Receive_IT(&huart1, rxData, 5);
#endif

    printf("system init hclk:%d\r\n",HAL_RCC_GetHCLKFreq());

#ifdef SUPPORT_FATFS
#ifdef SPI_HARD
    SD_Init();
#else
    SDInit();
#endif
    printf("SDInit ok!\r\n");
    //SD_ReadFileList("");
    //SD_ReadFileList("/f1");
    //SD_ReadFileList("/f2");
    //SD_fileCopy();           //测试函数
#endif

#if(PROJECTOR_OSRAM)
    I2C_init();
    SD_ReadPhotoFileList("/OSRAM/Photo");
    SD_ReadFilmFolderList("/OSRAM/Film");

    for(int i=0;i < filmTotalProgram; i++)
    {
        SD_ReadFilmFileList(i);
    }
#endif
    printf("Files Ready!\r\n");

#if(PROJECTOR_MBI5124)
    //reg_config();
#endif
    while (1)
    {
        //Drv_PWM_Proc();
#if(PROJECTOR_MBI5153)
        MBI5153_X();
        //MBI5153_play();
        //MBI5153_Sink();
#elif(PROJECTOR_MBI5124)
        if(scenMode==0)
            MBI5124_X();
        else if(scenMode==1)
            MBI5124_Sink();
        else if(scenMode==2)
            MBI5124_Play();
        else if(scenMode==3)
            MBI5124_Prompt();
        //else if(scenMode==4)
        //    MBI5124_Cartoon();
#elif(PROJECTOR_OSRAM)
        OSRAM_config();
        OSRAM_play();
        //Delay_ms(200);
        //EPLOS_status_read();
        //Delay_ms(200);

#elif(PROJECTOR_MCUGPIO)
        MCUGpio_X();
        //MCUGpio_Sink();
#endif

        Drv_SERIAL_Proc();

/*
        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);
        Delay_ms(100);

        HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);
        Delay_ms(100);
*/
    }
}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Initializes the CPU, AHB and APB busses clocks 
    */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = 16;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI_DIV2;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL16;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
        Error_Handler();
    }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK)
    {
        Error_Handler();
    }

    /**Configure the Systick interrupt time 
    */
    HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/(1000*500));

    /**Configure the Systick 
    */
    HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

    /* SysTick_IRQn interrupt configuration */
    HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* USART1 init function */
static void MX_USART1_UART_Init(void)
{

    huart1.Instance = USART1;
    huart1.Init.BaudRate = 9600;
    huart1.Init.WordLength = UART_WORDLENGTH_8B;
    huart1.Init.StopBits = UART_STOPBITS_1;
    huart1.Init.Parity = UART_PARITY_NONE;
    huart1.Init.Mode = UART_MODE_TX_RX;
    huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart1.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&huart1) != HAL_OK)
    {
        Error_Handler();
    }
}

/* USART1 init function */
static void MX_USART2_UART_Init(void)
{

    huart2.Instance = USART2;
    huart2.Init.BaudRate = 9600;
    huart2.Init.WordLength = UART_WORDLENGTH_8B;
    huart2.Init.StopBits = UART_STOPBITS_1;
    huart2.Init.Parity = UART_PARITY_NONE;
    huart2.Init.Mode = UART_MODE_TX_RX;
    huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart2.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&huart2) != HAL_OK)
    {
        Error_Handler();
    }
}

/* USART1 init function */
static void MX_USART3_UART_Init(void)
{

    huart3.Instance = USART3;
    huart3.Init.BaudRate = 115200;
    huart3.Init.WordLength = UART_WORDLENGTH_8B;
    huart3.Init.StopBits = UART_STOPBITS_1;
    huart3.Init.Parity = UART_PARITY_NONE;
    huart3.Init.Mode = UART_MODE_TX_RX;
    huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    huart3.Init.OverSampling = UART_OVERSAMPLING_16;
    if (HAL_UART_Init(&huart3) != HAL_OK)
    {
        Error_Handler();
    }
}

void init_tim3PWMIO()
{
    GPIO_InitTypeDef GPIO_InitStruct;
    
