85hzc/ask_433/stm32f1_cube/Src/main.c
  sConfigIC.ICPolarity = TIM_INPUTCHANNELPOLARITY_FALLING;
  sConfigIC.ICSelection = TIM_ICSELECTION_DIRECTTI;
  sConfigIC.ICPrescaler = TIM_ICPSC_DIV1;
  sConfigIC.ICFilter = 0;
  if (HAL_TIM_IC_ConfigChannel(&htim2, &sConfigIC, TIM_CHANNEL_1) != HAL_OK)
  {
    Error_Handler();
  }
}

void Drv_PWM_Init(void)
{
    HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);

    tickstart = HAL_GetTick();
}

void Drv_PWM_Proc(void)
{
    if (turn_off)
    {
        if((HAL_GetTick() - tickstart) > 1000)
        {
            turn_off = 0;
            __HAL_TIM_SET_COMPARE(&htim2,TIM_CHANNEL_1, (uint32_t)100);
        }
    }
}
#endif

/*****************************************************************************
*    function:
*        void SHT_set_scl_state(uint8_t flag)
*    description:
*        设置SCL口的输出状态
*    param:
*        int flag :  0 : 输出为0
*                1 : 输出为1
*    return:    
*        void
*****************************************************************************/
void I2C_set_scl_state(uint8_t flag)
{
    if (flag)
        HAL_GPIO_WritePin(SCL_GPIO_Port, I2C_SCL_PIN, GPIO_PIN_SET);
    else
        HAL_GPIO_WritePin(SCL_GPIO_Port, I2C_SCL_PIN, GPIO_PIN_RESET);
}

/*****************************************************************************
*    function:
*        uint8_t SHT_get_sda_state(void);
*    description:
*        读取SDA口的状态值
*    param:
*        void
*    return:    
*        int : IO的状态
*****************************************************************************/
uint8_t I2C_get_sda_state(void)
{
    if (GPIO_PIN_RESET!=HAL_GPIO_ReadPin(SDA_GPIO_Port, I2C_SDA_PIN))
    {
        return 1;
    }
    else
    {
        return 0;
    }
}

/*****************************************************************************
*    function:
*        void SHT_set_sda_state(uint8_t flag)
*    description:
*        设置SDA口的输出状态
*    param:
*        int flag :  0 : 输出为0
*                1 : 输出为1
*    return:    
*        void
*****************************************************************************/
void I2C_set_sda_state(uint8_t flag)
{
    if (flag)
        HAL_GPIO_WritePin(SDA_GPIO_Port, I2C_SDA_PIN, GPIO_PIN_SET);
    else
        HAL_GPIO_WritePin(SDA_GPIO_Port, I2C_SDA_PIN, GPIO_PIN_RESET);
}

//Init I2C pin
void I2C_init(void)
{
    GPIO_InitTypeDef GPIO_InitStruct;

    GPIO_InitStruct.Pin = I2C_SDA_PIN | I2C_SCL_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_OD;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_MEDIUM;
    HAL_GPIO_Init(SDA_GPIO_Port, &GPIO_InitStruct);

    I2C_set_sda_state(1);
    I2C_set_scl_state(1);
}

/* USER CODE BEGIN 4 */
int fputc(int ch, FILE *f)
{
    HAL_UART_Transmit(&DEBUG_UART, (uint8_t *)&ch,1, 0xFFFF);
    return ch;
}

void UsartReceive_IDLE(UART_HandleTypeDef *huart)
{
    uint32_t temp;

    if((__HAL_UART_GET_FLAG(huart,UART_FLAG_IDLE) != RESET))
    {
        __HAL_UART_CLEAR_IDLEFLAG(huart);
        HAL_UART_DMAStop(huart);
        temp = huart->hdmarx->Instance->CNDTR;

        if(huart->Instance == USART1)
        {
            UsartType1.RX_Size = UART_RX_LEN - temp;
            UsartType1.RX_flag = 1;
            HAL_UART_Receive_DMA(huart, UsartType1.RX_pData, UART_RX_LEN);
        } else if(huart->Instance == USART2)
        {
            UsartType2.RX_Size = UART_RX_LEN - temp;
            UsartType2.RX_flag = 1;
            HAL_UART_Receive_DMA(huart, UsartType2.RX_pData, UART_RX_LEN);
        } else if(huart->Instance == USART3)
        {
            UsartType3.RX_Size = UART_RX_LEN - temp;
            UsartType3.RX_flag = 1;
            HAL_UART_Receive_DMA(huart, UsartType3.RX_pData, UART_RX_LEN);
        }
    }
}

void UartControlHandle(uint8_t *key)
{
    uint16_t ttt;
    uint16_t IR_code = 0;

/*
    IR_code = REMOTE_MI_DOWN;
    IR_code = REMOTE_MI_LEFT;
    IR_code = REMOTE_MI_RIGHT;
    IR_code = REMOTE_MI_PLUS;
    IR_code = REMOTE_MI_MINUS;
    IR_code = REMOTE_MI_BACK;
    IR_code = REMOTE_MI_HOME;//focus+
    IR_code = REMOTE_MI_MENU;//focus-
    IR_code = REMOTE_MI_OK;
*/
    printf("UartControlHandle key:%s\r\n",key);

    if(!strcmp(key,"stop"))
    {
        //stop
        runFlag = 0;
    }
    else if(!strcmp(key,"start"))
    {
        //play
        runFlag = 1;
    }
    else if(!strcmp(key,"next"))
    {
        IR_code = REMOTE_MI_DOWN;
        photoIdx++;
    }
    else if(!strcmp(key,"pre"))
    {
        if(photoIdx>0)
        {
            photoIdx--;
        }
        IR_code = REMOTE_MI_UP;
    }
    else if(!strcmp(key,"poweron"))
    {
        IR_code = REMOTE_MI_POWER;
        powerFlag = powerFlag==1?0:1;
    }
    else //flash time and display scens
    {
        ttt = atoi(key);
        if(ttt>15)
        {
            actTime = ttt-15;
        }
        else if(ttt<=15 && ttt>10)
        {
            if(ttt==11)
                scenMode = 0;
            else if(ttt==12)
                scenMode = 1;
            else if(ttt==13)
                scenMode = 2;
            else if(ttt==14)
                scenMode = 3;
            else if(ttt==15)
                scenMode = 4;
        }
        else
        {
            actType = ttt;
        }
    }

    if (IR_code) {

        Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_IR, CMD_OP_IR_CODE), IR_code);
    }
}

void AppControlHandle(uint8_t *key)
{
    uint16_t ttt;
    uint16_t IR_code = 0;


    printf("AppControlHandle key:%s\r\n",key);

    if(!strcmp(key,"stop"))
    {
        //stop
        runFlag = 0;
    }
    else if(!strcmp(key,"start"))
    {
        //play
        runFlag = 1;
    }
    else if(!strcmp(key,"next"))
    {
        IR_code = REMOTE_MI_DOWN;
        photoIdx++;
    }
    else if(!strcmp(key,"pre"))
    {
        if(photoIdx>0)
        {
            photoIdx--;
        }
        IR_code = REMOTE_MI_UP;
    }
    else if(!strcmp(key,"poweron"))
    {
        IR_code = REMOTE_MI_POWER;
        powerFlag = powerFlag==1?0:1;
    }
    else //flash time and display scens
    {
        ttt = atoi(key);
        if(ttt>15)
        {
            actTime = ttt-15;
        }
        else if(ttt<=15 && ttt>10)
        {
            if(ttt==11)
                scenMode = 0;
        }
        else
        {
            actType = ttt;
        }
    }

    if (IR_code) {

        Drv_SERIAL_Act(SET_CODE(CMD_CODE_MASK_IR, CMD_OP_IR_CODE), IR_code);
    }
}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
